app/Controllers/HolaMundo.php

    public function index()
    {
        $userModel = new UserModel();
        //$user = $userModel->find('1');
        //$users = $userModel->find([1,2]);
        //$users = $userModel->findAll(); //recuperar todos los registros, sin incluir los registros eliminados suavemente (soft deleted).
        //$users = $userModel->where('name','Maria')->findAll();//recuperar todos los registros donde el nombre sea igual a Maria
        //$users = $userModel->findAll(3,2);//Recuperar registros utilizando limites (3 registros a partir del indice 2)
        $users = $userModel->withDeleted()->findAll();//recuperar todos los registros, incluidos los registros eliminados suavemente (soft deleted).
---
SELECT *
FROM `users`