app/Controllers/HolaMundo.php

    public function guarda()
    {
        helper('url');
        $userModel = new UserModel();
        $request = \Config\Services::request();

        $data = [
            'name' => $this->request->getPost('name'),
            'email' => $this->request->getPost('email')
        ];
        if ($request->getPostGet('id')) {
            $data['id'] = $request->getPostGet('id');
        }

        if ($userModel->save($data)) {
---
INSERT INTO `users` (`name`, `email`) VALUES ('Lola', 'lola@hotmail.com')

	public function editar()
    {
        $userModel = new UserModel();
        $request = \Config\Services::request();
        $id = $request->getPostGet('id');
        //echo "El id es:".$id;
        $user = $userModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '24'

    public function index()
    {
        $userModel = new UserModel();
        //$user = $userModel->find('1');
        //$users = $userModel->find([1,2]);
        //$users = $userModel->findAll(); //recuperar todos los registros, sin incluir los registros eliminados suavemente (soft deleted).
        //$users = $userModel->where('name','Maria')->findAll();//recuperar todos los registros donde el nombre sea igual a Maria
        //$users = $userModel->findAll(3,2);//Recuperar registros utilizando limites (3 registros a partir del indice 2)
        $users = $userModel->findAll(); //recuperar todos los registros, incluidos los registros eliminados suavemente (soft deleted).
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL